tap "argoproj/tap"
tap "hashicorp/tap"
tap "michaeleisel/zld"
brew "age"
brew "aws-vault"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "bitwarden-cli"
brew "bottom"
brew "chezmoi"
brew "cmake"
brew "colima", restart_service: :changed
brew "coreutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doggo"
brew "dust"
brew "elixir"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gleam"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gping"
brew "httpie"
brew "hwloc"
brew "hyperfine"
brew "iftop"
brew "janet"
brew "jj"
brew "jq"
brew "just"
brew "k6"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "libpq", link: true
brew "maven"
brew "mcfly"
brew "mergiraf"
brew "minisign"
brew "mise"
brew "nmap"
brew "nushell"
brew "ollama"
brew "pinentry-mac"
brew "powerlevel10k"
brew "procs"
brew "pure"
brew "ripgrep"
brew "sleepwatcher"
brew "terraform"
brew "testkube"
brew "tinyproxy"
brew "tmux"
brew "tokei"
brew "tree"
brew "watch"
brew "yarn"
brew "ykman"
brew "yq"
brew "zig"
brew "zola"
brew "zoxide"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "hashicorp/tap/vault"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "gpg-suite"
cask "iterm2"
cask "macupdater"
cask "ngrok"
cask "stats"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
go "cmd/go"
go "cmd/gofmt"
